cask_args appdir: '/Applications'

#tap 'homebrew/core'
#tap 'homebrew/php'
#tap 'homebrew/bundle'
#tap 'homebrew/services'
tap 'homebrew/cask-fonts'
#tap 'caskroom/cask'
#tap 'caskroom/versions'

brew 'git'
brew 'mas'

brew 'unrar'

#cask 'xquartz'

brew 'python'
brew 'python3'

brew 'curl'
brew 'wget'
brew 'httpie'
brew 'jq'
brew 'mtr'
brew 'nmap'
brew 'rsync'
brew 'telnet'
brew 'wrk'

brew 'ffmpeg'
brew 'node@12'
brew 'vim'
brew 'watch'
brew 'fish'

brew 'dnsmasq', restart_service: true
brew 'mysql@5.7', restart_service: true
brew 'postgresql@11', restart_service: true
brew 'postgis'
brew 'redis', restart_service: true
brew 'nginx', args: ['--with-debug'], restart_service: true

brew 'git-flow-avh'

brew 'graphicsmagick'
brew 'imagemagick'

brew 'htop'
brew 'iftop'

# brew 'wine'
# brew 'winetricks'

brew 'php@7.3'
#brew 'php@7.3-pdo-pgsql'
#brew 'php71-xdebug'
brew 'composer'

cask 'google-chrome'
cask 'iterm2'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'dropbox'
cask 'transmission'
cask 'choosy'

cask 'docker'

cask 'skype'
#cask 'spotify'
cask 'vlc'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'teamviewer'
#cask 'pgadmin3'
cask 'pgadmin4'
#cask 'sequel-pro'
cask '1password'
cask 'postman'
cask 'jetbrains-toolbox'
cask 'clipy'
#cask 'fantastical'
#cask 'forklift'
#cask 'mindnode-pro'
cask 'little-snitch'
#cask 'postico'
cask 'telegram'
#cask 'android-platform-tools'

cask 'iina'
cask 'font-fira-code-nerd-font'

cask 'vnc-viewer'
cask 'krisp'
cask 'numi'
cask 'choosy'
cask 'discord'
cask 'firefox'
cask 'keyboardcleantool'
cask 'yandex-disk'
cask 'plex-media-server'
cask 'tunnelblick'
cask 'zoomus'

# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
mas 'Monosnap', id: 540348655
mas 'Xcode', id: 497799835
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pocket', id: 568494494
mas 'Save to Pocket', id: 1477385213
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'Tab Suspender for Safari', id: 1495356253
mas 'Tab Space', id: 1473726602
mas 'Polyglot', id: 1471801525
mas 'Slack', id: 803453959
mas 'Telegram', id: 747648890
mas 'Monosnap - screenshot editor', id: 540348655
mas 'Gapplin', id: 768053424
mas 'AdGuard for Safari', id: 1440147259

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'betterzip'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'qlvideo'


