cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/php'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/fonts'
tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'git'
brew 'mas'

cask 'google-chrome'
cask 'iterm2'
cask 'sublime-text'
cask 'dropbox'
cask 'transmission'

cask 'docker-edge'
# brew 'docker-compose' # already in docker-edge

cask 'filezilla'
cask 'skype'
#cask 'spotify'
cask 'vlc'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'teamviewer'
cask 'pgadmin3'
cask 'pgadmin4'
#cask 'sequel-pro'
#cask '1password'
cask 'postman'
cask 'jetbrains-toolbox'
cask 'clipy'
#cask 'fantastical'
#cask 'forklift'
#cask 'mindnode-pro'
#cask 'little-snitch'
#cask 'postico'
#cask 'sequel-pro'
cask 'telegram-desktop'

cask 'iina'
cask 'font-fira-code'

# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
mas 'Monosnap', id: 540348655
mas 'Xcode', id: 497799835

brew 'unrar'

cask 'xquartz'

brew 'python'
brew 'python3'

brew 'curl'
brew 'wget'
brew 'httpie'
brew 'jq'
brew 'mtr'
brew 'nmap'
brew 'rsync'
brew 'telnet'
brew 'wrk'

brew 'ffmpeg'
brew 'node'
brew 'vim', args: ['--with-override-system-vi']
brew 'watch'
brew 'fish'

brew 'dnsmasq', restart_service: true
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'postgis'
brew 'redis', restart_service: true
brew 'nginx', args: ['--with-debug'], restart_service: true

brew 'git-flow-avh'

brew 'graphicsmagick'
brew 'imagemagick'

brew 'htop'
brew 'iftop'

# brew 'wine'
# brew 'winetricks'

brew 'php71'
brew 'php71-pdo-pgsql'
brew 'php71-xdebug'
brew 'composer'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'betterzip'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'qlvideo'


